{
  "title": "Обо мне",
  "subtitle": "Увлечен созданием надежных, масштабируемых решений",
  "imageAlt": "Влад Мозговой - Технический лидер команды",
  "content": {
    "paragraph1": "Мой путь в программировании начался в Таллинском техническом университете, но настоящее обучение началось, когда я понял, что создание отличного программного обеспечения — это не только алгоритмы, но и люди. За 18+ лет у меня была привилегия работать в разных странах и отраслях — от Эстонии до международных рынков.",
    "paragraph2": "Что меня мотивирует? Я верю, что лучшие решения появляются, когда все в команде чувствуют себя комфортно, делясь своими самыми смелыми идеями, когда младшие разработчики не боятся ставить под сомнение решения старших, и когда мы поддерживаем здоровые границы, которые позволяют каждому привносить лучшее из себя в работу. Мой технический фокус — на корпоративных Java приложениях, B2B интеграциях и масштабируемых архитектурах, но моя настоящая страсть — создавать среды, где блестящие люди могут выполнять свою лучшую работу.",
    "paragraph3": "Каждый день я могу совмещать передовые технические вызовы с наставничеством потрясающих разработчиков. Я понял, что своевременная поставка и поддержание высокого качества кода — это не только о процессе — это о построении доверия, поощрении любопытства и обеспечении того, чтобы каждый чувствовал себя услышанным. В последнее время меня волнует то, как инструменты ИИ могут усилить то, в чем мы уже хороши, давая нашей команде сверхспособности вместо замены человеческого творчества и сотрудничества, которые делают разработку программного обеспечения по-настоящему вознаграждающей."
  },
  "highlights": {
    "experience": {
      "title": "18+ лет опыта",
      "description": "Обширный опыт в экосистеме Java и корпоративной разработке"
    },
    "international": {
      "title": "Международные проекты",
      "description": "Мультидоменные системные внедрения и B2B интеграции"
    },
    "goalFocused": {
      "title": "Ориентированность на цели",
      "description": "Доказанный опыт соблюдения сроков и целей проекта"
    },
    "multilingual": {
      "title": "Мультиязычность",
      "description": "Родной английский/русский, профессиональный эстонский, средний испанский"
    }
  },
  "education": {
    "title": "Образование",
    "university": "Таллинский технический университет",
    "years": "2004 - 2007"
  }
}
