{
  "projects": {
    "interprefy": {
      "description": "Руковожу технической трансформацией глобальной языковой платформы, интегрируя передовые ИИ технологии для перевода в реальном времени, транскрипции и возможностей преобразования текста в речь. Управляю переходом от традиционного перевода к ИИ/гибридным решениям.",
      "highlights": [
        "Перевел платформу на горизонтальное масштабирование, обрабатывая тысячи одновременных пользователей с нулевым временем простоя",
        "Руководил переходом команды от ориентации на переводчиков к платформе на основе ИИ",
        "Интегрировал множество ИИ сервисов для обработки языков в реальном времени",
        "Реализовал собственные алгоритмы для ИИ перевода в реальном времени и обработки аудио"
      ]
    },
    "audatex": {
      "description": "Возглавлял архитектурную трансформацию AudaNet от монолитной к микросервисной архитектуре, обслуживая страховые компании в более чем 15 странах. Руководил B2B интеграциями и переходом frontend на React.",
      "highlights": [
        "Руководил миграцией от монолита к архитектуре микросервисов",
        "Управлял B2B интеграциями с более чем 50 бэк-офисными системами страхования",
        "Модернизировал пользовательский frontend опыт с React"
      ]
    },
    "nasdaq": {
      "description": "Ведущий разработчик MHUB, центральной инфраструктуры обмена сообщениями для коммуникаций фондов и депозитариев в балтийской финансовой экосистеме. Проектировал безопасные, высокопроизводительные потоки сообщений, обрабатывающие миллионы ежедневных транзакций.",
      "highlights": [
        "Спроектировал систему маршрутизации сообщений, обрабатывающую более 1М транзакций в день",
        "Интегрировался с более чем 20 банками и депозитарными системами в 3 странах",
        "Реализовал стратегии развертывания с нулевым временем простоя"
      ]
    },
    "elisa": {
      "description": "Ключевой участник YouRoam, сложной телекоммуникационной платформы, управляющей партнерствами роуминга для балтийских телекоммуникационных операторов. Реализовал сложный функционал импорта/экспорта данных, поддерживающий множество международных форматов, и модернизировал UI для улучшения пользовательского опыта.",
      "highlights": [
        "Спроектировал надежную систему импорта/экспорта, обрабатывающую более 10 различных форматов телеком данных",
        "Оптимизировал работу с базами данных для повышения масштабируемости",
        "Реализовал сложные алгоритмы ценообразования для различных сценариев роуминга"
      ]
    },
    "government": {
      "description": "Разработал критическую правительственную инфраструктуру, управляющую пособиями и социальным обеспечением для граждан Эстонии.",
      "highlights": [
        "Обработал заявления на пособия для более чем 500К граждан Эстонии",
        "Интегрировался с правительственными департаментами и унаследованными системами"
      ]
    }
  }
}